Test_Edo/Labs/a-combustorSimple/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp -r 0.bak 0

runApplication blockMesh

runApplication renumberMesh -overwrite

runApplication simpleFoam

# ----------------------------------------------------------------- end-of-file
